public/programming/gists/python/k-means.py.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../../index.html">Giovanni's Diary</a> &gt; <a href="../../../subjects.html">Subjects</a> &gt; <a href="../../programming.html">Programming</a> &gt; <a href="../gists.html">Gists</a> &gt;
</p>
<div id="outline-container-org3de39e5" class="outline-2">
<h2 id="org3de39e5">Python / k-means.py</h2>
<div class="outline-text-2" id="text-org3de39e5">
<p>
Implementation of k-means clustering in Python.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #989898;"># </span><span style="color: #989898;">k-means
</span><span style="color: #989898;"># </span><span style="color: #989898;">=======
</span><span style="color: #989898;">#</span><span style="color: #989898;">
</span><span style="color: #989898;"># </span><span style="color: #989898;">Implementation of k-means clustering in Python.
</span><span style="color: #989898;">#</span><span style="color: #989898;">
</span><span style="color: #989898;"># </span><span style="color: #989898;">Credits to: https://towardsdatascience.com/create-your-own-k-means-clustering-algorithm-in-python-d7d4c9077670/
</span><span style="color: #989898;"># </span><span style="color: #989898;">Requirements:
</span><span style="color: #989898;">#  </span><span style="color: #989898;">- matplotlib
</span><span style="color: #989898;">#  </span><span style="color: #989898;">- seaborn
</span><span style="color: #989898;">#  </span><span style="color: #989898;">- scikit-learn
</span><span style="color: #989898;">#</span><span style="color: #989898;">
</span>
<span style="color: #b6a0ff;">import</span> seaborn <span style="color: #b6a0ff;">as</span> sns
<span style="color: #b6a0ff;">import</span> matplotlib
matplotlib.use(<span style="color: #79a8ff;">"TkAgg"</span>)
<span style="color: #b6a0ff;">import</span> matplotlib.pyplot <span style="color: #b6a0ff;">as</span> plt
<span style="color: #b6a0ff;">import</span> sklearn.preprocessing <span style="color: #b6a0ff;">as</span> skp
<span style="color: #b6a0ff;">import</span> sklearn.datasets <span style="color: #b6a0ff;">as</span> skd
<span style="color: #b6a0ff;">import</span> numpy <span style="color: #b6a0ff;">as</span> np
<span style="color: #b6a0ff;">import</span> numpy.random <span style="color: #b6a0ff;">as</span> npr
<span style="color: #b6a0ff;">import</span> random

<span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">euclidean</span>(point, data):
    <span style="color: #9ac8e0;">"""
    Euclidean distance between point and data.
    Point has dimensions (m,), data has dimensions (n,m),
    and output will be of size (n,).
    """</span>
    <span style="color: #b6a0ff;">return</span> np.sqrt(np.<span style="color: #f78fe7;">sum</span>((point - data)**2, axis=1))

<span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">KMeans</span>:

    <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">__init__</span>(<span style="color: #b6a0ff;">self</span>, n_clusters=8, max_iter=300):
        <span style="color: #b6a0ff;">self</span>.<span style="color: #00d3d0;">n_clusters</span> = n_clusters
        <span style="color: #b6a0ff;">self</span>.<span style="color: #00d3d0;">max_iter</span> = max_iter

    <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">fit</span>(<span style="color: #b6a0ff;">self</span>, X_train):
        <span style="color: #989898;"># </span><span style="color: #989898;">Randomly select centroid start points, uniformly
</span>        <span style="color: #989898;"># </span><span style="color: #989898;">distributed across the domain of the dataset
</span>        <span style="color: #989898;"># </span><span style="color: #989898;">min_ = np.min(X_train, axis=0)
</span>        <span style="color: #989898;"># </span><span style="color: #989898;">max_ = np.max(X_train, axis=0)
</span>        <span style="color: #989898;">#</span><span style="color: #989898;">self.centroids = [npr.uniform(min_, max_) for _ in range(self.n_clusters)]
</span>
        <span style="color: #989898;"># </span><span style="color: #989898;">Initialize the centroids, using k-means++ method
</span>        <span style="color: #989898;"># </span><span style="color: #989898;">where a random datapoint is selected as the first,
</span>        <span style="color: #989898;"># </span><span style="color: #989898;">then the rest are initialized w/ probabilities
</span>        <span style="color: #989898;"># </span><span style="color: #989898;">proportional to their distances to the first
</span>        <span style="color: #b6a0ff;">self</span>.<span style="color: #00d3d0;">centroids</span> = [random.choice(X_train)]
        <span style="color: #b6a0ff;">for</span> _ <span style="color: #b6a0ff;">in</span> <span style="color: #f78fe7;">range</span>(<span style="color: #b6a0ff;">self</span>.n_clusters-1):
            <span style="color: #00d3d0;">dists</span> = np.<span style="color: #f78fe7;">sum</span>([euclidean(centroid, X_train) <span style="color: #b6a0ff;">for</span> centroid <span style="color: #b6a0ff;">in</span> <span style="color: #b6a0ff;">self</span>.centroids], axis=0)
            <span style="color: #00d3d0;">dists</span> /= np.<span style="color: #f78fe7;">sum</span>(dists)
            <span style="color: #00d3d0;">new_centroid_idx</span>, = np.random.choice(<span style="color: #f78fe7;">range</span>(<span style="color: #f78fe7;">len</span>(X_train)), size=1, p=dists)
            <span style="color: #b6a0ff;">self</span>.<span style="color: #00d3d0;">centroids</span> += [X_train[new_centroid_idx]]

        <span style="color: #00d3d0;">iteration</span> = 0
        <span style="color: #00d3d0;">prev_centroids</span> = <span style="color: #00bcff;">None</span>
        <span style="color: #b6a0ff;">while</span> np.not_equal(<span style="color: #b6a0ff;">self</span>.centroids, prev_centroids).<span style="color: #f78fe7;">any</span>() <span style="color: #b6a0ff;">and</span> iteration &lt; <span style="color: #b6a0ff;">self</span>.max_iter:
            <span style="color: #989898;"># </span><span style="color: #989898;">Sort each data point, assigning to nearest centroid
</span>            <span style="color: #00d3d0;">sorted_points</span> = [[] <span style="color: #b6a0ff;">for</span> _ <span style="color: #b6a0ff;">in</span> <span style="color: #f78fe7;">range</span>(<span style="color: #b6a0ff;">self</span>.n_clusters)]
            <span style="color: #b6a0ff;">for</span> x <span style="color: #b6a0ff;">in</span> X_train:
                <span style="color: #00d3d0;">dists</span> = euclidean(x, <span style="color: #b6a0ff;">self</span>.centroids)
                <span style="color: #00d3d0;">centroid_idx</span> = np.argmin(dists)
                sorted_points[centroid_idx].append(x)

            <span style="color: #989898;"># </span><span style="color: #989898;">Push current centroids to previous, reassign
</span>            <span style="color: #989898;"># </span><span style="color: #989898;">centroids as mean of the points belonging to them
</span>            <span style="color: #00d3d0;">prev_centroids</span> = <span style="color: #b6a0ff;">self</span>.centroids
            <span style="color: #b6a0ff;">self</span>.<span style="color: #00d3d0;">centroids</span> = [np.mean(cluster, axis=0) <span style="color: #b6a0ff;">for</span> cluster <span style="color: #b6a0ff;">in</span> sorted_points]
            <span style="color: #b6a0ff;">for</span> i, centroid <span style="color: #b6a0ff;">in</span> <span style="color: #f78fe7;">enumerate</span>(<span style="color: #b6a0ff;">self</span>.centroids):
                <span style="color: #989898;"># </span><span style="color: #989898;">Catch any np.nans, resulting from a centroid
</span>                <span style="color: #989898;"># </span><span style="color: #989898;">having no points
</span>                <span style="color: #b6a0ff;">if</span> np.isnan(centroid).<span style="color: #f78fe7;">any</span>():
                    <span style="color: #b6a0ff;">self</span>.<span style="color: #00d3d0;">centroids</span>[i] = prev_centroids[i]
            <span style="color: #00d3d0;">iteration</span> += 1

    <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">evaluate</span>(<span style="color: #b6a0ff;">self</span>, X):
        <span style="color: #00d3d0;">centroids</span> = []
        <span style="color: #00d3d0;">centroid_idxs</span> = []
        <span style="color: #b6a0ff;">for</span> x <span style="color: #b6a0ff;">in</span> X:
            <span style="color: #00d3d0;">dists</span> = euclidean(x, <span style="color: #b6a0ff;">self</span>.centroids)
            <span style="color: #00d3d0;">centroid_idx</span> = np.argmin(dists)
            centroids.append(<span style="color: #b6a0ff;">self</span>.centroids[centroid_idx])
            centroid_idxs.append(centroid_idx)

        <span style="color: #b6a0ff;">return</span> centroids, centroid_idx

<span style="color: #00d3d0;">centers</span> = 5

<span style="color: #989898;"># </span><span style="color: #989898;">Generate random data
</span><span style="color: #00d3d0;">X_train</span>, <span style="color: #00d3d0;">true_labels</span> = skd.make_blobs(n_samples=100,
                                     centers=centers,
                                     random_state=42)
<span style="color: #00d3d0;">X_train</span> = skp.StandardScaler().fit_transform(X_train)

<span style="color: #00d3d0;">kmeans</span> = KMeans(n_clusters=centers)
kmeans.fit(X_train)

<span style="color: #989898;"># </span><span style="color: #989898;">View results
</span><span style="color: #00d3d0;">class_centers</span>, <span style="color: #00d3d0;">classification</span> = kmeans.evaluate(X_train)
sns.scatterplot(x=[X[0] <span style="color: #b6a0ff;">for</span> X <span style="color: #b6a0ff;">in</span> X_train],
                y=[X[1] <span style="color: #b6a0ff;">for</span> X <span style="color: #b6a0ff;">in</span> X_train],
                hue=true_labels,
                style=classification,
                palette=<span style="color: #79a8ff;">"deep"</span>,
                legend=<span style="color: #00bcff;">None</span>)

plt.plot([x <span style="color: #b6a0ff;">for</span> x, _ <span style="color: #b6a0ff;">in</span> kmeans.centroids],
         [y <span style="color: #b6a0ff;">for</span> _, y <span style="color: #b6a0ff;">in</span> kmeans.centroids],
         <span style="color: #79a8ff;">'+'</span>,
         markersize=10);
plt.xlabel(<span style="color: #79a8ff;">"x"</span>)
plt.ylabel(<span style="color: #79a8ff;">"y"</span>)
plt.show()
</pre>
</div>


<hr />

<p>
Travel: <a href="../gists.html">Gists</a>, <a href="../../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
